In [54]:
import pandas as pd
import numpy as np

data = pd.read_csv('operations.csv')
data.head()

,date_operation,libelle,montant,solde_avt_ope,categ
0,2023-03-31,DON XX XX XX XX XX XX XX,-1.44,1515.25,AUTRE
1,2023-04-03,CARTE XX XX RAPT XX,-24.00,1513.81,TRANSPORT
2,2023-04-03,CARTE XX XX RAPT XX,-73.00,1489.81,TRANSPORT
3,2023-04-03,VIREMENT XX XX XX XX XX XX XX XX XX XX XX XX,676.00,1416.81,AUTRE
4,2023-04-03,VIREMENT XX XX XX XX XX XX,4.80,2092.81,AUTRE

In [55]:
print(data.isnull().sum())

date_operation    0
libelle           0
montant           2
solde_avt_ope     0
categ             1
dtype: int64

In [56]:
data.shape

(309, 5)

In [57]:
data['date_operation'] = pd.to_datetime(data['date_operation'], format='%Y/%m/%d', errors='coerce')

In [58]:
data.loc[pd.isna(data['date_operation']), :]

Empty DataFrame
Columns: [date_operation, libelle, montant, solde_avt_ope, categ]
Index: []

In [59]:
data['montant']  = pd.to_numeric(data['montant'], errors='coerce')
data['solde_avt_ope']  = pd.to_numeric(data['montant'], errors='coerce')

In [60]:
mask = ~data['montant'].isnull()
data  = data.loc[mask]
data.shape

(307, 5)

In [61]:
mask = ~data['solde_avt_ope'].isnull()
data  = data.loc[mask]
data.shape

(307, 5)

In [62]:
data.loc[data['categ'].isnull(), 'categ'] = 'AUTRE'

In [63]:
print(data.isnull().sum())

date_operation    0
libelle           0
montant           0
solde_avt_ope     0
categ             0
dtype: int64